
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/Akihiro1001/aws-ecs-terraform/actions/runs/5008876484)



<pre><code>Apply complete! Resources: 6 added, 2 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0320ac62caeaa7389]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0f0dd577b6a580cb7]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-056fe42137121ab23]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0055e2096efcdf432]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0d213fca1fe5e63ac]
aws_security_group.ecs: Refreshing state... [id=sg-0d9c9b456395c778a]
aws_security_group.alb: Refreshing state... [id=sg-0d1fb1e79c58dc2bc]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0863081fb8ee5dc4b]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-053e7113956f941a5]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0ee05e5fe37c19eb6]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-05f8d8de411c15369]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-03f34da35d1513cc6]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0777319f9135b1951]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-04b35dbc37682e7c6]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0b7620782af7fcfdc]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0239dae77dd06e08b]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-3601755104]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0aa82e323ed8a1986]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0a7f35f189649afbf]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0777319f9135b19511080289494]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0fcd1681f1faef93a]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-03ab0044aef7d9e99]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-01404b9acf6c213fc]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-079b4d08769220b42]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-04b35dbc37682e7c61080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0ee05e5fe37c19eb61080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_lb.alb will be created
  + resource "aws_lb" "alb" {
      + arn                                         = (known after apply)
      + arn_suffix                                  = (known after apply)
      + desync_mitigation_mode                      = "defensive"
      + dns_name                                    = (known after apply)
      + drop_invalid_header_fields                  = false
      + enable_deletion_protection                  = false
      + enable_http2                                = true
      + enable_tls_version_and_cipher_suite_headers = false
      + enable_waf_fail_open                        = false
      + enable_xff_client_port                      = false
      + id                                          = (known after apply)
      + idle_timeout                                = 60
      + internal                                    = (known after apply)
      + ip_address_type                             = (known after apply)
      + load_balancer_type                          = "application"
      + name                                        = "go-simple-server-alb"
      + preserve_host_header                        = false
      + security_groups                             = [
          + "sg-0d1fb1e79c58dc2bc",
        ]
      + subnets                                     = [
          + "subnet-03f34da35d1513cc6",
          + "subnet-05f8d8de411c15369",
        ]
      + tags_all                                    = (known after apply)
      + vpc_id                                      = (known after apply)
      + xff_header_processing_mode                  = "append"
      + zone_id                                     = (known after apply)
    }

  # aws_lb_listener.alb_listener will be created
  + resource "aws_lb_listener" "alb_listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Fixed response content"
              + status_code  = "200"
            }
        }
    }

  # aws_lb_listener_rule.alb_listener_rule will be created
  + resource "aws_lb_listener_rule" "alb_listener_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = (known after apply)
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "*",
                ]
            }
        }
    }

  # aws_lb_target_group.target_group will be created
  + resource "aws_lb_target_group" "target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "go-simple-server-target-group"
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0320ac62caeaa7389"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/health_checks"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = "eipalloc-0f0dd577b6a580cb7"
      + association_id       = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = "subnet-03f34da35d1513cc6"
      + tags                 = {
          + "Name" = "aws-ecs-terraform-ap-northeast-1a"
        }
      + tags_all             = {
          + "Name" = "aws-ecs-terraform-ap-northeast-1a"
        }
    }

  # module.vpc.aws_nat_gateway.this[1] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = "eipalloc-056fe42137121ab23"
      + association_id       = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = "subnet-05f8d8de411c15369"
      + tags                 = {
          + "Name" = "aws-ecs-terraform-ap-northeast-1c"
        }
      + tags_all             = {
          + "Name" = "aws-ecs-terraform-ap-northeast-1c"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be updated in-place
  ~ resource "aws_route" "private_nat_gateway" {
        id                     = "r-rtb-04b35dbc37682e7c61080289494"
      ~ nat_gateway_id         = "nat-0a7f35f189649afbf" -> (known after apply)
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_route.private_nat_gateway[1] will be updated in-place
  ~ resource "aws_route" "private_nat_gateway" {
        id                     = "r-rtb-0ee05e5fe37c19eb61080289494"
      ~ nat_gateway_id         = "nat-0aa82e323ed8a1986" -> (known after apply)
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 6 to add, 2 to change, 0 to destroy.
aws_lb_target_group.target_group: Creating...
module.vpc.aws_nat_gateway.this[1]: Creating...
module.vpc.aws_nat_gateway.this[0]: Creating...
aws_lb.alb: Creating...
aws_lb_target_group.target_group: Creation complete after 1s [id=arn:aws:elasticloadbalancing:ap-northeast-1:115748871192:targetgroup/go-simple-server-target-group/26c097ce080cf4b2]
module.vpc.aws_nat_gateway.this[0]: Still creating... [10s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [10s elapsed]
aws_lb.alb: Still creating... [10s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [20s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [20s elapsed]
aws_lb.alb: Still creating... [20s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [30s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [30s elapsed]
aws_lb.alb: Still creating... [30s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [40s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [40s elapsed]
aws_lb.alb: Still creating... [40s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [50s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [50s elapsed]
aws_lb.alb: Still creating... [50s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [1m0s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [1m0s elapsed]
aws_lb.alb: Still creating... [1m0s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [1m10s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [1m10s elapsed]
aws_lb.alb: Still creating... [1m10s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [1m20s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [1m20s elapsed]
aws_lb.alb: Still creating... [1m20s elapsed]
module.vpc.aws_nat_gateway.this[0]: Still creating... [1m30s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [1m30s elapsed]
aws_lb.alb: Still creating... [1m30s elapsed]
module.vpc.aws_nat_gateway.this[0]: Creation complete after 1m36s [id=nat-000163a37cac9c907]
module.vpc.aws_nat_gateway.this[1]: Still creating... [1m40s elapsed]
aws_lb.alb: Still creating... [1m40s elapsed]
module.vpc.aws_nat_gateway.this[1]: Still creating... [1m50s elapsed]
aws_lb.alb: Still creating... [1m50s elapsed]
module.vpc.aws_nat_gateway.this[1]: Creation complete after 1m56s [id=nat-067b3f66f6492f0af]
module.vpc.aws_route.private_nat_gateway[0]: Modifying... [id=r-rtb-04b35dbc37682e7c61080289494]
module.vpc.aws_route.private_nat_gateway[1]: Modifying... [id=r-rtb-0ee05e5fe37c19eb61080289494]
module.vpc.aws_route.private_nat_gateway[1]: Modifications complete after 1s [id=r-rtb-0ee05e5fe37c19eb61080289494]
module.vpc.aws_route.private_nat_gateway[0]: Modifications complete after 1s [id=r-rtb-04b35dbc37682e7c61080289494]
aws_lb.alb: Still creating... [2m0s elapsed]
aws_lb.alb: Creation complete after 2m3s [id=arn:aws:elasticloadbalancing:ap-northeast-1:115748871192:loadbalancer/app/go-simple-server-alb/65017f648e3d1160]
aws_lb_listener.alb_listener: Creating...
aws_lb_listener.alb_listener: Creation complete after 0s [id=arn:aws:elasticloadbalancing:ap-northeast-1:115748871192:listener/app/go-simple-server-alb/65017f648e3d1160/1c5f45c3b9982687]
aws_lb_listener_rule.alb_listener_rule: Creating...
aws_lb_listener_rule.alb_listener_rule: Creation complete after 1s [id=arn:aws:elasticloadbalancing:ap-northeast-1:115748871192:listener-rule/app/go-simple-server-alb/65017f648e3d1160/1c5f45c3b9982687/704b43ac89b14866]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 6 added, 2 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":4,"Program":"tfcmt","SHA1":"dad18204050855341426fe83a6d106f519352632","Vars":{},"WorkflowName":"Terraform"} -->